Sandgreenpanda/2026-ESP32/src/main.cpp
        rc = ssh_channel_request_pty(channel);
        if (rc != SSH_OK) {
            Serial.println("Request Fail");
            this->brutal_exception();
            return NULL;
        }
        rc = ssh_channel_change_pty_size(channel, 100, 30);
        if (rc != SSH_OK) {
            Serial.println("Resize Fail");
            this->brutal_exception();
            return NULL;
        }
        rc = ssh_channel_request_shell(channel);
        if (rc != SSH_OK) {
            Serial.println("Shell Fail");
            this->brutal_exception();
            return NULL;
        }
        return channel;
    }

    int read() {
        char buffer[256];
        int rbytes;

        if (channel != nullptr && session != nullptr && ssh_channel_is_open(channel) && ssh_is_connected(session)) {

            shh_output_send_temp = "";
            rbytes = ssh_channel_read_nonblocking(channel, buffer, sizeof(buffer), 0);

            if (rbytes > 0) {

                std::string msg(buffer, rbytes);
                if (clientsMutex != NULL && xSemaphoreTake(clientsMutex, pdMS_TO_TICKS(100)) == pdTRUE) {
                    for (int i = 0; i < MAX_CLIENTS; i++) {
                        if (activeClients[i] != nullptr) {
                            // Serial.print("THIS +");
                            //  Serial.println(msg.c_str());
                            activeClients[i]->send(msg, WebsocketHandler::SEND_TYPE_TEXT);
                        }
                    }
                    xSemaphoreGive(clientsMutex);
                } else {
                    Serial.println("Could not acquire lock on msg");
                }
            };
            return rbytes;
        }
        return -1;
        vTaskDelay(10 / portTICK_PERIOD_MS);
    }

    void write(String command) {
        Serial.println("ssh cmd received:");
        Serial.println(command);
        ssh_channel_write(channel, command.c_str(), command.length());
        Serial.println("ssh command processing finished");
    }

    void keep_alive() {
        ssh_send_ignore(session, "keepalive");
    }

    String exec_cmd(String command) {
        ssh_channel channel_oneoff = NULL;
        int rc;
        int nbytes;
        char buffer[256];
        String ssh_output = "";

        channel_oneoff = ssh_channel_new(session);
        if (channel_oneoff == NULL)
            return "-1"; // SSH ERROR

        rc = ssh_channel_open_session(channel_oneoff);
        if (rc != SSH_OK) {
            ssh_channel_free(channel_oneoff);
            return String(rc);
        }

        rc = ssh_channel_request_exec(channel_oneoff, command.c_str());
        if (rc != SSH_OK) {
            ssh_channel_close(channel_oneoff);
            ssh_channel_free(channel_oneoff);
            return String(rc);
        }

        unsigned long startTime = millis();

        while (ssh_channel_is_open(channel_oneoff) && !ssh_channel_is_eof(channel_oneoff)) {
            nbytes = ssh_channel_read_nonblocking(channel_oneoff, buffer, sizeof(buffer), 0);

            if (nbytes > 0) {
                ssh_output += String(buffer, nbytes);
                startTime = millis();
            } else if (nbytes == SSH_ERROR) {
                return "-1"; // SSH ERROR
            }

            if (millis() - startTime > SSH_SINGLE_EXEC_TIMEOUT) {
                Serial.println("Command timed out waiting for EOF!");
                break;
            }
            vTaskDelay(1 / portTICK_PERIOD_MS);
        }

        nbytes = ssh_channel_read_nonblocking(channel_oneoff, buffer, sizeof(buffer), 0);

        if (nbytes > 0) {
            ssh_output += String(buffer, nbytes);
            startTime = millis();
        } else if (nbytes == SSH_ERROR) {
            return "-1"; // SSH ERROR
        }

        ssh_channel_close(channel_oneoff);
        ssh_channel_free(channel_oneoff);

        return ssh_output;
    }

    void disconnect() {
        if (session != nullptr) {
            ssh_disconnect(session);
            ssh_free(session);
            ssh_finalize();
            session = nullptr;
        }
    }

// Ignore deprecated warnings
#pragma GCC diagnostic ignored "-Wdeprecated-declarations"
    int scp_read(String filepath) {
        // This function is straight from the libssh docs

        // scp is labeled as deprecated due to a security concern around connecting to untrusted servers. However you would have to be
        // On the same wifi network to take advantage of this, and since both esp and laptops remain static, Everything is fine.
        ssh_scp scp;
        int rc;

        scp = ssh_scp_new(session, SSH_SCP_READ, filepath.c_str());
        if (scp == NULL) {
            Serial.printf("Error allocating scp session: %s\n", ssh_get_error(session));
            return SSH_ERROR;
        }

        rc = ssh_scp_init(scp);
        if (rc != SSH_OK) {
            Serial.printf("Error initializing scp session: %s\n", ssh_get_error(session));
            ssh_scp_free(scp);
            return rc;
        }

        int mode;
        size_t size;
        char *filename, *buffer;

        rc = ssh_scp_pull_request(scp);
        if (rc != SSH_SCP_REQUEST_NEWFILE) {
            Serial.printf("Error receiving information about file: %s\n", ssh_get_error(session));
            return SSH_ERROR;
        }

        size = ssh_scp_request_get_size(scp);
        filename = strdup(ssh_scp_request_get_filename(scp));
        mode = ssh_scp_request_get_permissions(scp);
        Serial.printf("Receiving file %s, size %d, permissions 0%o\n", filename, size, mode);
        free(filename);

        // Memaloc... c things...
        buffer = static_cast<char *>(malloc(size));

        ssh_scp_accept_request(scp);
        rc = ssh_scp_read(scp, buffer, size);
        if (rc == SSH_ERROR) {
            Serial.printf("Error receiving file data: %s\n", ssh_get_error(session));
            free(buffer);
            return rc;
        }
        Serial.printf("Done\n");

        Serial.write((const uint8_t *)buffer, size);

        Serial.println();

        free(buffer);

        rc = ssh_scp_pull_request(scp);
        if (rc != SSH_SCP_REQUEST_EOF) {
            Serial.printf("Unexpected request: %s\n", ssh_get_error(session));
            return SSH_ERROR;
        }

        return SSH_OK;

        ssh_scp_close(scp);
        ssh_scp_free(scp);
        return SSH_OK;
    }
};

String FuncReadTemplate(String path, std::initializer_list<std::pair<String, String>> args) {
    String file = SD.open(path, FILE_READ).readString();

