Sandgreenpanda/2026-ESP32/src/main.cpp
    mbedtls_sha256_update(&ctx, (const unsigned char *)Session.c_str(), Session.length());
    mbedtls_sha256_finish(&ctx, shaResult);
    mbedtls_sha256_free(&ctx);

    // Convert the bytes to c str
    std::string hexStr = std::accumulate(shaResult, shaResult + 32, std::string{}, [](std::string str, uint8_t byte) {char buf[3];sprintf(buf, "%02x", byte);return str + buf; });

    Session_dict[hexStr.c_str()] = Session;

    Serial.println("KVDB HEX, Session vvv");
    Serial.println(hexStr.c_str());
    Serial.println(Session);

    String Cookie = String("session=") + hexStr.c_str() + String("; Path=/; SameSite=Strict; Secure");
    res->setHeader("Set-Cookie", Cookie.c_str());
    res->setHeader("Content-Type", "text/html");
    if (Session == PASSWORD) {
        res->println(SD.open("/templates/log_out.html", FILE_READ).readString());
    } else {
        String file = SD.open("/templates/admin.html", FILE_READ).readString();
        file.replace("%ERROR%", "The provided password was incorrect");
        res->println(file);
    }
};

void handle404(HTTPRequest *req, HTTPResponse *res) {
    // Discard request body, if we received any
    // We do this, as this is the default node and may also server POST/PUT requests
    req->discardRequestBody();

    // Set the response status
    res->setStatusCode(404);
    res->setStatusText("Not Found");

    // Set content type of the response
    res->setHeader("Content-Type", "text/html");

    // Write a tiny HTML page
    res->println("<!DOCTYPE html>");
    res->println("<html>");
    res->println("<head><title>Not Found</title></head>");
    res->println("<body><h1>404 Not Found</h1><p>The requested resource was not found on this server.</p></body>");
    res->println("</html>");
}